from math import *
# вычисление производной методами правосторонней и двусторонней разностей
h = 0.1
x = 0.2
i=1
f = log(1+x)
re= 1/1.2
print ('реальное значение производной == ',re)
print('метод правосторонней разности')
print(' №  численное значение\t\tшаг\t\t\tошибка')
while i < 20:
    h=0.1**i
    f2 = log( 1 + x + h)
    der = (f2-f) / (h)
    #print (der)
    print("%2.0f%24.20f%24.20f%24.20f"%(i,der,h,der-re))
    i= i + 1
print('метод двусторонней разности')
print(' №  численное значение\t\tшаг\t\t\tошибка')
h=0.1
i=1
while i < 20:
    h=0.1**i
    f2 = log(1 + x + h)
    f1 = log(1 + x - h)
    der = (f2-f1) / (2 * h)
    print("%2.0f%24.20f%24.20f%24.20f"%(i,der,h,der-re))
    i= i + 1

